Revit 2024 API
Document.SiteLocation Property
Returns the site location information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SiteLocation SiteLocation { get; }
Visual Basic
Public ReadOnly Property SiteLocation As SiteLocation
	Get
Visual C++
public:
property SiteLocation^ SiteLocation {
	SiteLocation^ get ();
}
Remarks
The SiteLocation property returns an object that contains the site location for the entire project.
See Also
Document Class
Autodesk.Revit.DB Namespace